#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
module.u_tractor_uptime.random_password.this[0]: Refreshing state... [id=none]
module.u_pbs_taiga.random_password.this[0]: Refreshing state... [id=none]
module.u_auth_keycloak.random_password.this[0]: Refreshing state... [id=none]
module.u_cosinus_ragflow.random_password.this[0]: Refreshing state... [id=none]
module.u_pbs_rally.random_password.this[0]: Refreshing state... [id=none]
module.u_pbs_hering.random_password.this[0]: Refreshing state... [id=none]
module.u_itkom_twitterbox.random_password.this[0]: Refreshing state... [id=none]
module.u_cosinus_ragflow.bitwarden_item_login.this[0]: Refreshing state... [id=6e486074-a7cd-40b7-8091-70d265da485c]
module.u_pbs_rally.bitwarden_item_login.this[0]: Refreshing state... [id=e50342f6-59dd-4589-a79e-d41d4c8ec03e]
data.bitwarden_item_login.mariadb_admin: Reading...
module.u_tractor_uptime.bitwarden_item_login.this[0]: Refreshing state... [id=9ea84cef-ae47-42bf-87d9-d26b9d755635]
module.u_itkom_twitterbox.bitwarden_item_login.this[0]: Refreshing state... [id=00657b03-8d62-437f-9686-ece83385f3f3]
data.bitwarden_item_login.postgres_admin: Reading...
module.u_auth_keycloak.bitwarden_item_login.this[0]: Refreshing state... [id=8a3f9b5e-2a23-4f94-8df2-9f7cbb8cd1d5]
module.u_pbs_taiga.bitwarden_item_login.this[0]: Refreshing state... [id=fc4f8cd4-c125-4b66-aaf2-3feaee3b48fe]
module.u_pbs_hering.bitwarden_item_login.this[0]: Refreshing state... [id=49a63c0b-894d-465a-8fa8-fb7e9af66dcb]
data.bitwarden_item_login.mariadb_admin: Read complete after 7s [id=49a3600f-90a7-40ae-b37c-d52e4f89c4d2]
module.db_tractor_uptime.mysql_database.this: Refreshing state... [id=tractor_uptime]
module.u_tractor_uptime.mysql_user.this: Refreshing state... [id=tractor_uptime@%]
data.bitwarden_item_login.postgres_admin: Read complete after 7s [id=c47b840b-6753-400f-91f8-97ec146f78d9]
module.u_auth_keycloak.postgresql_role.this: Refreshing state... [id=auth-keycloak]
module.u_pbs_rally.postgresql_role.this: Refreshing state... [id=pbs-rallly]
module.u_cosinus_ragflow.postgresql_role.this: Refreshing state... [id=cosinus-ragflow]
module.u_pbs_hering.postgresql_role.this: Refreshing state... [id=pbs-hering]
module.u_pbs_taiga.postgresql_role.this: Refreshing state... [id=pbs-taiga]
module.u_itkom_twitterbox.postgresql_role.this: Refreshing state... [id=itkom-twitterbox]
module.db_tractor_uptime.mysql_grant.this["tractor_uptime"]: Refreshing state... [id=tractor_uptime@%:`tractor_uptime`:*]
module.u_auth_keycloak.postgresql_grant_role.webadmin: Refreshing state... [id=webadmin_auth-keycloak_true]
module.db_auth_keycloak.postgresql_database.this: Refreshing state... [id=auth-keycloak]
module.u_cosinus_ragflow.postgresql_grant_role.webadmin: Refreshing state... [id=webadmin_cosinus-ragflow_true]
module.db_cosinus_ragflow.postgresql_database.this: Refreshing state... [id=cosinus-ragflow]
module.u_pbs_rally.postgresql_grant_role.webadmin: Refreshing state... [id=webadmin_pbs-rallly_true]
module.db_pbs_rally.postgresql_database.this: Refreshing state... [id=pbs-rallly]
module.u_itkom_twitterbox.postgresql_grant_role.webadmin: Refreshing state... [id=webadmin_itkom-twitterbox_true]
module.db_itkom_twitterbox.postgresql_database.this: Refreshing state... [id=itkom-twitterbox]
module.u_pbs_hering.postgresql_grant_role.webadmin: Refreshing state... [id=webadmin_pbs-hering_true]
module.db_pbs_hering.postgresql_database.this: Refreshing state... [id=pbs-hering]
module.u_pbs_taiga.postgresql_grant_role.webadmin: Refreshing state... [id=webadmin_pbs-taiga_true]
module.db_pbs_taiga.postgresql_database.this: Refreshing state... [id=pbs-taiga]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.u_test.bitwarden_item_login.this[0] will be created
  + resource "bitwarden_item_login" "this" {
      + attachments     = (known after apply)
      + collection_ids  = [
          + "282c01f1-2665-4c89-a7e7-04beb52290c4",
        ]
      + creation_date   = (known after apply)
      + deleted_date    = (known after apply)
      + id              = (known after apply)
      + name            = "pbs-test (Postgres)"
      + notes           = (sensitive value)
      + organization_id = "722d399f-2ed1-41d1-a420-e1aca40a6abc"
      + password        = (sensitive value)
      + revision_date   = (known after apply)
      + username        = (sensitive value)

      + uri {
          + match = "never"
          + value = "postgres.tractor.scout.ch:5432"
        }
    }

  # module.u_test.postgresql_grant_role.webadmin will be created
  + resource "postgresql_grant_role" "webadmin" {
      + grant_role        = "pbs-test"
      + id                = (known after apply)
      + role              = "webadmin"
      + with_admin_option = true
    }

  # module.u_test.postgresql_role.this will be created
  + resource "postgresql_role" "this" {
      + bypass_row_level_security = false
      + connection_limit          = -1
      + create_database           = true
      + create_role               = false
      + encrypted_password        = true
      + id                        = (known after apply)
      + inherit                   = true
      + login                     = true
      + name                      = "pbs-test"
      + password                  = (sensitive value)
      + replication               = false
      + skip_drop_role            = false
      + skip_reassign_owned       = false
      + superuser                 = false
      + valid_until               = "infinity"
    }

  # module.u_test.random_password.this[0] will be created
  + resource "random_password" "this" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"

```

</details>

*Pusher: @cleverer, Action: `pull_request`, Working Directory: `tofu`, Workflow: `Check Pull Request`*